import axios from "axios";
import React, { useEffect, useState } from "react";
import { Link } from "react-router-dom";
import { motion } from "framer-motion";

const MapReg = () => {
  const [countetBlogs, setCountetBlogs] = useState([]);
  const [position, setPosition] = useState({ x: 0, y: 0 });
  const [tooltip, setTooltip] = useState(null);
  const fetchBlogsByTags = async () => {
    try {
      const res = await axios.get("/api/blog/countbytags");
      if (res.data) setCountetBlogs(res.data);
    } catch (error) {
      console.log(error);
    }
  };
  useEffect(() => {
    fetchBlogsByTags();
  }, [countetBlogs]);
  const hoverRegion = (e) => {
    const region = document.getElementById(e.target.id);
    const descr = document.getElementById("descriptionmap");
    console.log(e);
    setPosition({ x: e.clientX, y: e.clientY });
    descr.innerHTML = region.getAttribute("description-data");

    descr.classList.add("active");
    //получение названия региона
    const regionName = region.getAttribute("region-name");

    let regions = countetBlogs.find((item) => item._id === regionName);
    setTooltip(regions);

    // Изменение стиля региона
    region.style.stroke = "green";
    region.style.strokeWidth = "3";
  };
  const leaveRegion = (e) => {
    const region = document.getElementById(e.target.id);
    const descr = document.getElementById("descriptionmap");
    descr.classList.remove("active");
    setTooltip(null);
    setPosition({ x: 0, y: 0 });

    // Возвращение стиля региона
    region.style.stroke = "blue";
    region.style.strokeWidth = "1";
  };
  return (
    <div id="map" className="w-[70%] mx-auto">
      <svg viewBox="0 0 470.83636 443.78183">
        <g>
          <g>
            <Link to="/blog/regions/lev-tolstoy">
              <path
                id="onet"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Лев-Толстовский район"
                d="m 263.49063,61.182695 -0.21318,3.624062 2.77134,0.852721 1.70544,3.624062 -4.2636,2.771342 -2.55816,0.42636 v 6.395404 l -8.31402,8.100844 0.63954,3.837243 -2.34498,4.903142 -2.34499,3.197702 0.21318,2.771343 1.91862,2.55816 -1.49226,2.34498 -2.77134,2.98452 -1.91862,3.19771 -2.55816,3.1977 -0.42636,2.34498 2.34498,0.42636 1.91862,1.27908 2.55816,0.42636 2.34498,0.21318 1.06591,0.42636 -1.70545,3.83724 1.49227,0.42636 2.34498,1.49226 1.27908,1.70544 1.27908,0.85272 -0.85272,2.77135 1.49226,1.27908 1.70544,-0.63954 1.0659,1.27908 3.1977,0.42636 1.0659,-0.42636 1.0659,1.49226 h 3.83725 1.0659 l 0.21318,-1.91862 4.2636,-5.54269 8.5272,1.0659 2.34499,1.70545 -1.27909,2.77134 -0.21318,3.1977 0.63954,2.55816 v 1.0659 l 0.85273,1.59885 -0.63955,1.49226 -0.53295,2.87793 1.27909,0.85273 4.90314,1.27908 2.66475,-3.51748 3.41088,0.53295 2.55816,-2.02521 h 3.3043 l 0.85272,-5.86245 2.66475,-1.49226 -1.27908,-7.35472 -7.88767,-4.15701 v -1.27908 l 10.12606,-0.95931 0.63954,-2.87793 2.02521,-1.91862 1.91862,0.42636 1.81203,-2.34498 2.55816,-0.95931 0.31977,-2.45157 1.91862,-1.59886 0.21318,-3.09111 -2.98452,-4.37019 -1.91862,-1.59885 0.85272,-3.197703 3.62406,-1.385671 0.42636,-2.771341 2.13181,-2.238392 -5.11633,-4.263602 -1.27908,-3.837242 1.0659,-3.624063 4.90315,-0.42636 0.21318,-3.197702 3.83724,3.197702 2.55816,-4.050422 1.91862,-0.852721 -1.49226,-4.050422 1.27908,-1.279081 v -1.918621 l -4.68996,-4.050422 -1.70544,0.21318 -2.77135,-0.63954 h -3.1977 l 0.21318,3.410882 -1.49226,1.0659 -5.75586,-2.344981 -2.1318,3.197702 -9.37993,-1.705441 -1.49226,-3.410882 1.27908,-1.492261 -1.49226,-1.279081 -7.88766,-2.771341 -1.27908,-2.344982 -10.65901,-2.131801 -1.70544,5.542683 -2.34498,0.639541 -2.98452,-1.705441 z"
                description-data="<img src='/gerb/levt.jpg'><br><b> Лев-Толстовский район</b><br><br>Астаповский (позже переименован в Лев-Толстовский) район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Козловский округ).
20 октября 1933 года Президиум ВЦИК постановил «Перечислить Люблинский и Зыковский сельсоветы Лев-Толстовского района в Раненбургский район»*
После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 26 сентября 1937 года — во вновь образованную Рязанскую область. После образования 6 января 1954 года Липецкой области включён в её состав. 1 февраля 1963 район был упразднён (территория вошла в Данковский и Чаплыгинский районы), но 11 января 1965 года восстановлен.
Законом Липецкой области от 02 июля 2004 года № 114-ОЗ[6] 12 сельсоветов района были наделены статусом сельских поселений, включая Лев-Толстовский сельсовет, образованный после перевода посёлка Лев Толстой в разряд сельских населённых пунктов.
28 апреля 2010 года Законом Липецкой области № 385-ОЗ были упразднены Ильинский и Кузовлевский сельсоветы."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Лев-Толстовский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/dankov">
              <path
                id="twon"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Данковский район"
                className="part"
                d="m 228.52909,49.457789 4.47678,3.197701 1.27909,8.953566 1.49226,2.131801 3.1977,-2.558162 1.70544,-0.63954 0.42636,2.344981 5.54268,-3.837242 2.34498,1.279081 2.98453,-1.918621 3.62406,4.689962 4.90314,-2.131801 h 2.55816 l 1.0659,3.837242 2.55816,0.852721 1.0659,3.410882 -1.27908,1.918621 -4.05042,1.279081 -0.85272,1.0659 -0.42636,4.689963 -1.70544,2.984522 -6.60858,5.755863 0.63954,3.410882 -4.26361,7.248124 -0.63954,2.344982 1.91862,6.182222 -3.62406,1.91862 -0.63954,3.1977 -2.55816,2.13181 -1.70544,2.77134 -0.21318,2.1318 0.0425,0.83295 -5.50205,0.67833 -1.95963,-0.97982 -0.30149,3.16557 -2.26111,1.58278 -7.38632,2.86408 2.11038,2.86408 -2.18575,1.43204 -0.0754,1.8089 1.39436,1.54509 -0.22611,1.88427 -3.35399,2.11037 -1.95964,-4.52223 -4.10769,-4.33381 -1.95964,0.86676 0.90445,1.8089 -1.2813,1.50741 -7.87622,2.75102 0.67833,1.58278 -1.2813,2.60029 -1.73352,-0.64065 -7.46169,-1.05519 -1.58278,-3.09019 -4.37149,-2.71334 -2.33649,1.20593 -1.35667,-0.60297 -2.11037,-3.8439 -3.46705,0.75371 -2.26111,-3.8439 -4.74835,1.65815 -3.69316,0.60297 -2.63797,-2.93945 0.75371,-1.95964 -2.93945,-4.14538 -5.27594,3.54242 -3.91927,2.33648 -3.3163,-6.18038 -6.78335,-1.50741 0.15074,-5.87891 6.63261,-3.61778 0.7537,-4.22075 -4.07001,-3.01483 1.80889,-2.864077 -7.23557,-3.768528 -2.5626,-9.798172 -1.95963,-1.658152 3.91927,-6.934091 9.49669,-4.672975 3.46704,0.452224 1.20593,1.507411 5.72816,-3.014822 8.89373,-0.301483 1.35667,-8.592243 -4.82372,-5.878903 -1.35667,-9.798172 4.07001,-3.768528 -5.57742,-9.49669 3.46705,-4.823716 7.53705,-3.617786 7.38632,-0.150741 4.37149,-1.658153 2.5626,5.878904 3.01482,-6.180386 -0.7537,-4.07001 5.8789,0.602965 2.41186,2.562598 4.52223,-2.411857 3.76853,2.110375 6.78335,-1.507411 4.67297,4.974457 0.30148,9.044466 6.02965,4.07001 -0.90445,4.974457 3.61779,4.07001 z"
                description-data="<img src='/gerb/dankov.jpg'> <br><b> Данковский район</b><br><br>Данковский уезд входил в состав Рязанской губернии.
Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Козловский округ).
1 ноября 1932 года из Данковского района в Ефремовский район Тульской области были переданы Дубровский, Козьинский, Лавровский, Октябрьский, Ступинский, Хомяковский и Шиловский сельсоветы.
После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 26 сентября 1937 года — во вновь образованную Рязанскую область.
После образования 6 января 1954 года Липецкой области включён в её состав. 19 ноября 1959 года в состав Данковского района была включена территория упразднённых Берёзовского района[6]. В 1963 году в состав района включена большая часть упразднённого Воскресенского района.
2 июля 2004 года законом Липецкой области № 114-ОЗ  в районе были образованы 1 городское поселение (Данков) и 22 сельских поселений (сельсоветов)."
              />
            </Link>
            <foreignObject className="win__two" id="dankov">
              <span>Данковский район</span>
              <br />
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/chapligin">
              <path
                id="three"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Чаплыгинский район"
                className="part"
                d="m 287.16182,56.527917 1.05518,-3.617787 0.30149,-16.883005 0.7537,-3.014822 -1.50741,-2.110375 0.60297,-0.904447 4.07001,2.261117 2.71334,-3.467046 15.37559,-7.687796 4.52223,-5.728163 4.52223,4.522234 -0.7537,4.672974 5.8789,-1.35667 1.35667,-2.864081 6.02965,4.823716 3.61778,1.658152 3.01483,7.537055 3.91926,-0.150741 3.01483,12.812995 -4.67298,4.220751 4.82372,1.055187 4.37149,-0.301482 1.95963,10.250396 6.78335,0.301482 0.60297,3.165563 6.93409,-0.150741 1.80889,1.658152 2.5626,-3.617786 0.15074,6.934091 4.82372,-0.452223 0.30148,16.28004 -4.52223,0.753705 -4.52224,7.386314 -0.30148,11.456324 4.22075,3.01482 -0.7537,5.1252 1.35667,8.74299 1.65815,1.95963 2.86408,-0.15074 -3.46704,7.08483 1.50741,5.1252 1.05518,1.80889 -0.7537,3.76853 1.80889,1.80889 -3.61778,7.53706 -6.02965,2.86408 -1.20593,1.95963 5.42668,4.67298 -0.7537,2.86408 -5.87891,0.60296 -2.5626,3.01483 -2.86408,-0.45223 -1.05518,-1.65815 0.15074,-2.26112 -1.35667,-1.65815 -0.97982,2.48723 -2.48723,-1.43204 -0.67833,-4.29612 -1.73353,-2.26112 -0.22611,-2.63797 -1.88426,-2.63797 -1.2813,1.2813 -1.05519,-1.2813 -0.15074,-4.74834 -1.05519,-2.18575 -5.1252,1.2813 -1.20592,-1.13056 1.05518,-1.43204 -1.65815,-1.13056 -1.88426,0.15074 v -2.035 l -10.2504,-1.58278 -2.26111,1.35667 -4.44687,-2.11038 -3.54241,-0.67833 -3.69316,-2.78871 -5.72816,2.26111 -1.35667,-7.1602 -4.67298,-3.54242 -3.09019,-0.90444 v -0.82908 l 3.61779,-0.90444 6.48186,-0.15075 0.15075,-3.09019 2.035,-2.035 2.03501,0.67833 2.41185,-3.01482 1.95964,-0.30148 0.37685,-3.01483 2.11038,-1.58278 -0.0754,-2.86408 -3.8439,-5.20057 -1.35667,-0.67833 1.35667,-2.864082 3.61778,-1.35667 0.0754,-3.391675 2.11038,-1.884264 -1.2813,-2.788711 -2.5626,-0.527594 -2.41186,-2.71334 v -3.693157 l 1.50741,-2.110375 4.3715,-0.07537 0.15074,-3.542416 3.99464,3.391675 2.63797,-4.296122 1.80889,-0.602964 -1.13056,-3.768528 1.2813,-0.979817 -0.52759,-2.71334 -4.14538,-3.99464 -1.73353,0.602965 -2.56259,-1.507411 -4.07001,0.829076 1.05518,2.487228 -2.18574,2.035005 -5.57742,-2.78871 -2.26112,3.617786 -4.89909,-1.507411 -3.54241,-0.07537 -2.03501,-2.63797 0.90445,-2.035005 -1.65815,-2.261117 -3.46705,-0.376852 -3.91927,-1.205929 z"
                description-data="<img src='/gerb/chap.jpg'><br><b> Чаплыгинский район</b><br><br> Раненбургский район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Козловский округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской.
20 октября 1933 года Президиум ВЦИК постановил «Перечислить Люблинский и Зыковский сельсоветы Лев-Толстовского района в Раненбургский район»*
26 сентября 1937 года — включён во вновь образованную Рязанскую область. 1 марта 1944 года часть территории Раненбургского района была передана в новый Колыбельский район. В 1948 году переименован в Чаплыгинский район. После образования 6 января 1954 года Липецкой области включён в её состав.
4 июля 1956 года в состав Чаплыгинского района включена часть упразднённого Колыбельского района. 1 февраля 1963 также упразднённый Троекуровский район вошёл в Чаплыгинский."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Чаплыгинский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/dobroe">
              <path
                id="four"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                region-name="Добровский район"
                strokeOpacity="0.8"
                className="part"
                d="m 370.82313,164.30781 -6.93409,0.45222 -1.65815,3.61779 -3.16556,-0.30148 -1.35667,-1.80889 0.60296,-2.71334 -1.95963,-2.11038 -0.90445,2.71334 -2.41186,-1.50741 -0.60296,-4.52223 -1.8089,-2.41186 -0.30148,-2.5626 -1.65815,-2.41186 -1.35667,1.50741 -0.90445,-1.35667 -0.45222,-5.57742 -1.20593,-1.80889 -4.97446,1.95963 -1.20593,-1.35667 1.05519,-1.20593 -1.50741,-1.35667 -1.95963,0.15074 v -2.11037 l -10.55188,-1.20593 -1.95964,1.35667 -4.22075,-2.26112 -4.22075,-0.60296 -3.61778,-3.16556 -8.14002,3.76852 -0.60297,5.27594 -3.46704,0.75371 -2.26112,2.26111 -3.76853,-0.7537 -2.71334,3.3163 -6.02964,-1.50741 -6.63261,4.07001 -0.45222,2.41186 -3.16557,5.57742 8.4415,12.96374 v 2.86408 l -3.3163,0.60296 -1.35667,3.61779 -8.89373,6.78335 0.15075,3.46704 h -2.86409 l -1.80889,3.16557 4.07001,9.49669 3.46705,-0.90445 1.20593,-2.11037 7.53705,-4.22076 4.97446,1.65816 1.35667,-1.95964 2.86408,1.05519 2.86408,-1.05519 1.80889,1.8089 -3.46704,10.70261 7.68779,1.50742 3.16557,1.05518 5.27594,6.02965 6.18038,1.95963 3.46705,5.87891 0.90444,0.7537 1.65816,1.95964 -2.86409,1.65815 1.35667,1.20593 7.83854,-0.75371 1.50741,-2.71334 2.71334,-1.05519 2.86408,0.75371 2.5626,2.11037 4.22075,-0.60296 2.41186,1.50741 1.8089,-0.30148 3.61778,-3.91927 2.5626,0.75371 v -4.82372 l 5.8789,1.95963 3.31631,-1.50741 -0.15074,-5.42668 4.07001,4.52224 2.86408,-0.60297 -1.50741,-6.48187 h 2.5626 l 1.80889,-8.14002 0.30148,-7.53705 -2.5626,-4.52223 0.75371,-5.42668 -5.8789,-2.5626 -2.71334,-4.22075 6.02964,-1.65816 0.75371,-6.02964 5.8789,0.45222 1.50741,-2.11037 -4.37149,-5.87891 0.15074,-0.15074"
                description-data="<img src='/gerb/dobroe.jpg'><br><b> Добровский район</b><br><br> Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Козловский округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 26 сентября 1937 года — во вновь образованную Рязанскую области. После образования 6 января 1954 года Липецкой области включён в её состав. 1 марта 1944 года часть территории Добровского района была передана в новый Колыбельский район[5].19 ноября 1959 года к Добровскому району была присоединена часть территории упразднённого Липецкого района[6]. 1 февраля 1963 район был упразднён (территория вошла в Липецкий и Чаплыгинский районы), но 11 января 1965 года восстановлен."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Добровский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/lebedyan">
              <path
                id="five"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Лебедянский район"
                className="part"
                d="m 157.54011,124.49719 -1.0659,5.54269 -1.0659,4.58337 2.34498,2.23839 2.23839,-0.42636 3.83724,2.1318 0.74614,2.77134 1.59885,-1.17249 11.08536,2.23839 0.42636,5.00974 1.91862,-2.45158 5.86246,0.95931 -0.10659,6.18223 6.82176,8.74038 -2.55816,4.68997 1.27908,2.87793 4.47678,3.09111 3.73066,-0.31977 5.3295,3.83724 0.10659,1.0659 -4.58337,1.70544 0.42636,4.58338 5.00973,3.51747 2.1318,-1.81203 3.09111,1.59885 0.31977,5.22291 0.85272,1.81203 0.42636,2.77134 -4.2636,-1.0659 -2.1318,0.53295 0.21318,2.87793 4.2636,3.83725 -0.53295,4.2636 -0.42636,4.79655 7.03495,3.1977 8.20743,1.27908 2.1318,3.41089 1.17249,0.31977 0.74613,-1.27908 4.68997,-1.49226 2.1318,0.95931 2.55816,-0.53295 1.38567,-1.38568 5.43609,0.95932 2.55816,-0.95932 -0.42636,-9.5931 2.23839,0.53295 2.98453,-2.34498 9.69969,-2.34498 6.502,0.31977 -3.73066,-9.27334 1.81203,-3.41088 2.66476,0.10659 -0.21318,-2.87793 8.95356,-7.67449 1.38567,-3.41088 3.30429,-0.21318 v -2.77134 l -7.99425,-13.21717 2.98452,-5.22291 0.42636,-2.34498 6.18222,-4.2636 1.49227,-5.22292 -1.1725,-1.0659 0.21318,-8.95356 1.27909,-0.74613 -3.3043,-2.55817 -7.35471,-0.42636 -4.90314,5.00974 0.10659,2.55816 -5.32951,0.10659 -1.0659,-2.1318 -3.94383,0.74613 -1.0659,-2.34498 -0.95931,1.70544 -1.91862,-1.17249 -0.21318,-1.81203 0.95931,-1.0659 -6.28881,-4.47679 0.74613,-4.37019 -4.47679,-0.10659 -3.09111,-2.23839 -7.24812,1.17249 -2.23839,-1.49226 -0.42636,3.83724 -9.37993,4.05042 2.34498,3.1977 -2.55816,0.95932 v 1.91862 l 1.49226,1.91862 -0.31977,1.91862 -3.41088,1.81203 -1.27908,-3.41088 -3.30429,-4.47678 -1.70545,-1.38568 -1.70544,1.38568 1.0659,2.02521 -1.91862,1.59885 -7.56789,2.34498 0.85272,2.02521 -1.17249,2.23839 -2.02521,-0.85272 -7.24813,-1.17249 -1.49226,-2.66475 -4.47678,-2.98452 -2.55816,1.27908 -1.27908,-0.74613 -2.02521,-3.62407 -3.62407,0.85273 -1.91862,-3.73066 -5.54268,1.49226 -3.51747,0.31977 -2.1318,-2.66475 0.31977,-2.02521 -2.23839,-4.2636 z"
                description-data="<img src='/gerb/lebed.jpg'><br><b> Лебедянский район</b><br><br> Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО). Изначально входил в Елецкий округ, упразднённый по постановлению от 23 июля 1930 года. После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 26 сентября 1937 года — во вновь образованную Рязанскую область. После образования 6 января 1954 года Липецкой области включён в её состав."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Лебедянский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/krasnoe">
              <path
                id="six"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                region-name="Краснинский район"
                strokeOpacity="0.8"
                className="part"
                d="m 150.74111,139.28479 4.07001,8.59224 -7.53705,0.30148 -0.45223,3.61779 -5.42668,-2.5626 0.30148,3.61779 -3.3163,1.95963 -0.75371,4.52223 -3.61778,2.5626 3.01482,5.1252 -0.45222,7.08483 h 2.26111 l 0.15074,3.01483 7.23558,6.33112 -2.5626,4.22075 -2.5626,0.30149 -2.18575,2.71334 -1.95963,0.15074 -0.0754,1.50741 1.95963,2.035 0.5276,3.91927 -1.2813,1.73352 0.37685,1.88427 -1.2813,1.13056 -0.15074,1.2813 1.73352,1.35667 4.89909,-0.0754 2.33649,2.63796 -0.30149,2.41186 5.72817,3.01482 3.39167,0.75371 3.46705,2.33649 2.18574,-2.18575 1.8089,0.37685 1.88426,1.73353 0.75371,-2.11038 -1.50742,-2.33649 4.59761,-2.93945 1.73352,0.22611 -0.45222,2.78871 2.18574,3.54242 0.60297,3.01482 5.72816,4.07001 2.86408,-0.15074 4.22075,3.8439 3.99464,1.05519 1.73352,2.86408 1.50742,-0.15074 3.3163,-7.1602 3.61779,-2.78872 1.20593,-3.69315 0.52759,-9.7228 4.37149,-0.82908 2.33649,1.50741 2.48723,-2.035 0.22611,-3.54242 -4.07001,-4.52223 -0.22611,-2.63797 2.26111,-0.45223 1.88427,1.05519 2.11037,0.0754 v -2.71334 l -1.2813,-2.18574 -0.0754,-4.74835 -3.24093,-1.65815 -1.95963,1.2813 -5.1252,-3.46705 -0.45223,-4.37149 4.44687,-1.88426 0.0754,-1.20593 -5.27594,-3.46705 -3.54242,0.0754 -4.89908,-3.16556 -0.97982,-2.41186 2.26112,-4.74834 -2.18575,-4.07001 -4.5976,-4.74835 0.0754,-6.25575 -5.87891,-1.13056 -1.65815,2.41185 -0.52759,-4.97445 -11.30559,-2.11038 -1.80889,1.20593 -0.37685,-2.86408 -3.8439,-1.95963 -2.11038,0.52759 -2.71334,-2.71334 -0.90444,5.72816 z"
                description-data="<img src='/gerb/krasnoe.png'><br><b> Краснинский район</b><br><br> Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 27 сентября 1937 года — во вновь образованную Орловскую область. После образования 6 января 1954 года Липецкой области включён в её состав. 1 февраля 1963 район был упразднён (территория вошла в Лебедянский район), но 11 января 1965 года восстановлен."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Краснинский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/stanovoe">
              <path
                id="seven"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Становлянский район"
                className="part"
                d="m 130.69254,147.72629 1.95964,-0.30148 0.15074,4.22075 6.02964,1.80889 -0.30148,4.22075 -1.50741,2.26112 -2.71334,1.65815 2.86408,5.42668 -0.60296,7.08483 h 2.5626 l -0.15075,2.5626 3.91927,2.86408 3.31631,4.22075 -2.41186,4.22076 h -2.78871 l -1.95964,2.86408 -1.95963,-0.0754 -0.52759,1.58278 2.33648,2.18574 0.5276,3.39168 -1.20593,2.11037 0.0754,1.65816 -1.13056,0.97981 v 1.35667 l 1.2813,1.50741 h 4.74835 l 2.56259,2.5626 v 3.01483 l 4.07001,1.88426 0.37686,6.55724 -2.93945,2.11037 -3.01483,3.61779 -0.60296,-1.2813 -2.11038,-0.52759 -4.44686,2.33648 -7.61243,0.30149 -5.04982,2.93945 -0.97982,2.86408 -2.18575,1.43204 -1.43204,2.71334 -2.5626,-1.13056 -0.52759,2.71334 0.75371,3.16556 -5.42668,3.16557 -0.75371,-2.11038 -3.09019,-3.01482 -8.14002,-1.58278 -1.507413,-2.63797 -5.049828,-0.82908 -0.150741,-6.02964 1.582782,-1.88427 -6.481868,-7.83853 -0.753705,3.69315 -2.336488,-1.35667 -1.808893,1.05519 1.582782,2.93945 -6.029645,3.16557 -6.632609,-7.23558 0.07537,-3.01482 -4.446863,-0.30148 0.904447,-4.97446 1.055188,-1.73352 -2.110376,-7.38631 1.733523,-3.0902 -3.014822,-3.69315 2.035005,-1.65816 5.351309,0.45223 2.487228,-4.07001 -2.261116,-1.50741 -1.959635,1.43204 -4.14538,-3.31631 -2.336488,-0.60296 -3.316304,-2.63797 -3.090193,-7.76317 -1.884264,-1.20593 -6.85872,0.22611 -3.090193,-0.97981 -0.753706,-2.63797 -3.090192,0.82907 -0.527594,4.22075 -3.391675,0.30149 -6.105015,-4.59761 3.693157,-1.20593 -2.487228,-5.42668 0.452223,-2.41185 3.165563,-0.82908 3.165564,-10.40114 1.959634,0.0754 5.728162,-10.77799 11.531695,-0.97981 1.130559,2.93945 10.401136,-0.15074 6.180386,-1.8089 3.919269,5.04983 4.07001,1.65815 7.235573,8.9691 4.371492,-5.80353 7.235577,2.86408 3.39167,12.66225 4.52224,-1.58278 0.45222,-5.95427 9.42132,-0.45223 3.46704,-3.76853 0.22612,-6.18038 z"
                description-data="<img src='/gerb/stanovoe.jpg'><br><b> Становлянский район</b><br><br> Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 27 сентября 1937 года — во вновь образованную Орловскую область. После образования 6 января 1954 года Липецкой области включён в её состав.
1 февраля 1963 года в Становлянский влился соседний район — Волы́нский.
В июне 1984 года в состав села Плоского вошли деревня Становая и пристанционный посёлок Становая. В октябре 1984 года районный центр Становлянского района село Плоское был переименован в село Становое."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Становлянский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/izmalkovo">
              <path
                id="eight"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Измалковский район"
                className="part"
                d="m 40.717404,291.52382 8.314024,10.659 2.344982,-0.10659 1.492261,-2.02521 2.984521,1.27908 0.852721,-5.86245 -0.53295,-2.87793 1.38567,-2.87793 8.420615,-0.10659 14.176478,4.79655 -0.10659,-6.07563 -0.74613,-3.3043 -0.852721,-4.15701 5.755864,-2.34498 5.222913,-0.21318 -1.172491,-2.23839 0.31977,-4.15701 1.812031,-2.45157 -0.42636,-2.34499 -1.172491,-1.27908 2.823389,-3.58376 4.635289,2.14806 1.92195,-2.14806 3.014821,0.18842 -1.959634,-3.42936 0.263797,-2.71334 4.333807,-2.035 -2.41186,-2.22343 -3.01482,0.15074 -3.956954,2.52491 c 0,0 -1.35667,-3.54241 -2.035005,-3.16556 -0.678335,0.37685 -2.562599,1.58278 -2.562599,1.58278 l -2.261117,-2.63797 -3.090192,-0.22611 -3.203249,-1.65815 -1.733523,-1.99732 2.600284,-0.37686 0.866762,-1.28129 -1.733523,-2.14807 4.484548,-3.24093 1.733523,-2.86408 3.391675,1.35667 2.562599,-1.5451 -0.03769,-3.12787 0.301482,-5.84122 1.507411,-1.8089 -6.858721,-7.87622 -0.565279,4.14538 -2.562599,-1.84658 -1.582781,1.31899 1.733522,3.27862 -6.293441,2.71334 -6.670294,-6.97178 0.150741,-3.09019 -4.296122,-0.41454 0.678335,-4.55992 1.2813,-2.22343 -2.374173,-7.57474 1.884264,-2.86408 -2.901766,-3.5801 1.959634,-2.07269 5.238254,0.4899 2.411858,-3.65547 -2.110376,-1.69584 -1.846579,1.46973 -4.333807,-3.27862 -2.298801,-0.41454 -3.240934,-2.71334 -3.090193,-7.76316 -1.959635,-1.39436 -7.461685,0.11306 -2.298802,-0.79139 -0.565279,-0.75371 c 0,0 -0.188426,-1.84658 -0.339167,-1.88426 -0.150741,-0.0377 -3.35399,0.82907 -3.35399,0.82907 l -0.339167,4.44687 -3.467046,-0.0377 -1.620467,-1.05519 -3.542416,0.33917 4.559919,6.93409 -5.162883,0.41454 0.942131,3.8439 -3.42936,-0.33917 -1.808893,2.86408 9.345949,8.74299 3.919269,0.26379 -0.716021,14.47115 -4.635289,5.27594 -6.331126,4.29612 -0.150742,5.38899 -0.866761,1.13056 2.487228,2.18575 c 0,0 -3.353989,2.14806 -3.391675,2.2988 -0.03768,0.15074 2.901767,4.52223 2.901767,4.52223 l 0.376853,4.97446 -1.404563,2.05477 -5.969043,-1.17249 -2.664752,4.79655 -3.517472,-0.95931 -0.21318,2.66476 6.608584,2.77134 1.492261,4.05042 3.730652,-1.0659 1.17249,4.90314 0.746131,2.23839 3.624062,-1.81203 0.63954,3.73065 -8.100844,5.11633 -0.532951,5.64927 4.050423,2.1318 3.197702,-1.81203 4.903142,1.27908 0.532951,4.47678 1.705441,1.27908 3.304292,-2.55816 1.812031,4.05043 -1.065901,2.66475 H 42.63602 Z"
                description-data="<img src='/gerb/izmalkovo.png'><br><b> Измалковский район</b><br><br> Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, 18 января 1935 года — Курской области, а 27 сентября 1937 года включён во вновь образованную Орловскую область. После образования 6 января 1954 года Липецкой области стал её частью. 1 февраля 1963 район был упразднён (территория вошла в Становлянский и Елецкий районы), но 11 января 1965 года восстановлен."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Измалковский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/eletsky">
              <path
                id="nine"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Елецкий район"
                className="part"
                d="m 93.61023,233.34724 5.125198,1.05519 1.507412,3.16556 8.29076,1.05519 2.5626,2.86408 0.90445,2.41186 5.50205,-3.24094 -0.82908,-2.93945 0.75371,-3.09019 2.26111,1.05519 1.50741,-2.48723 2.26112,-1.43204 0.90445,-2.86408 4.44686,-2.33649 4.37149,-0.67834 3.91927,-0.15074 4.67297,-2.18574 1.88427,0.52759 0.52759,1.43204 3.0902,-3.76853 2.86408,-1.65815 -0.0754,-6.63261 0.37685,-0.52759 4.82371,1.80889 2.78871,1.8089 2.33649,-1.73353 h 1.58278 l 2.5626,1.95964 0.45223,-2.5626 -1.58279,-2.03501 4.22076,-2.63797 h 2.26111 l -0.52759,2.71334 2.11037,3.61779 0.60297,3.16556 4.29612,3.0902 1.65815,0.97981 2.48723,-0.30148 4.97446,4.29612 3.46704,0.75371 4.82372,8.4415 0.0754,3.8439 2.93945,2.86408 -2.5626,2.26112 -1.88426,-0.22611 -3.01482,0.7537 -2.5626,1.2813 -2.86408,-0.22611 -3.69316,2.26112 -2.11038,0.15074 -0.22611,3.16556 4.44686,5.57742 -1.80889,1.50741 -3.16556,-0.97981 -1.05519,0.37685 v 1.80889 l 3.69316,0.60297 2.71334,4.37149 -1.88427,0.90444 -2.41186,0.15075 0.15075,1.50741 1.65815,0.15074 1.35667,1.43204 -1.65815,0.60296 -0.45223,2.5626 1.13056,2.18575 2.18575,0.67833 -2.48723,2.18575 -5.04983,-2.33649 -6.18038,-6.02964 -3.8439,3.99464 -3.01482,5.35131 -0.22612,3.84389 0.75371,3.39168 0.22611,4.07001 0.90445,2.86408 -4.82372,3.69316 -2.33649,0.67833 0.82908,6.02965 -1.20593,1.13056 -4.44686,-0.97982 -1.88426,-2.78871 -0.15075,-5.04983 -2.41185,-0.22611 -1.95964,-1.88426 -1.50741,0.0754 -3.54242,5.35131 -5.80353,-1.05519 -2.48723,4.07001 -3.91927,-0.30148 -2.11037,-2.11038 -3.46705,0.97982 -1.95963,-1.8089 -0.45222,-3.54241 -1.95964,-0.45223 -1.73352,-2.26111 -1.50741,1.20593 -3.31631,-2.71334 -1.73352,0.0754 -0.75371,-1.65816 -2.33648,-0.52759 0.22611,-3.01482 1.2813,-1.2813 0.15074,-6.70798 2.48723,-1.73352 -1.8089,-1.73353 h -1.80889 l -3.69316,3.91927 -1.88426,-0.7537 -4.07001,0.37685 -2.035005,1.2813 -0.226111,1.20593 -2.71334,0.15074 -2.411858,-2.63797 -2.035005,-1.73352 v -3.91927 l 0.904447,-2.26112 1.055187,-0.82907 -0.301482,-2.41186 -1.205929,-1.05519 2.788711,-3.99464 4.597604,2.26112 1.582781,-2.18575 3.3163,0.0754 -1.733518,-2.86408 0.150741,-2.86408 4.446867,-2.11038 -2.78871,-2.33648 -2.562603,0.52759 -4.371493,2.11038 -1.959634,-3.01483 -2.411858,1.43204 -2.336487,-2.18574 -2.63797,-0.22611 -4.974456,-3.61779 0.07537,-0.52759 2.035005,-0.45223 0.979818,-0.90444 -1.507412,-2.33649 3.768528,-2.78871 2.411858,-2.93945 3.542416,0.97981 2.185746,-1.35667 z"
                description-data="<img src='/gerb/elecraion.jpg'><br> <b>Елецкий район</b><br><br> Район образован 10 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). 20 августа 1930 Елец выделен в город областного подчинения. После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 27 сентября 1937 года — во вновь образованную Орловскую область. После образования 6 января 1954 года Липецкой области включён в её состав."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Елецкий район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/elets">
              <path
                id="ten"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="г. Елец"
                d="m 125.5098,245.47691 2.55816,0.15989 1.0126,0.69283 1.22579,-0.58624 0.21318,-2.34498 1.97192,-0.74613 1.59885,-1.1725 2.71804,-1.11919 1.0659,0.85272 0.10659,1.97192 1.54556,1.86532 0.26648,2.39828 1.33237,0.37306 3.09111,-2.29168 2.77135,-3.46418 2.1318,0.74613 1.59885,1.91862 -0.69284,1.01261 0.10659,3.99712 -2.29168,2.61146 -1.70545,0.0533 -4.31689,3.1977 -4.63667,-0.21318 -4.47678,1.59885 -2.55816,1.17249 -1.65215,2.1318 -1.43897,-0.69283 0.15989,-1.33238 -2.71805,-7.30142 1.86533,-1.01261 0.31977,-1.0126 -1.49226,-1.75874 z"
                description-data="<img src='/gerb/elec.jpg'><br><b> Елец</b> <br><br> Еле́ц — город (с 1146 года) в России, административный центр Елецкого района Липецкой области. Является городом областного подчинения, в границах которого образовано муниципальное образование городской округ город Елец. Находится в 78 км к западу от Липецка. Расположен на берегах реки Быстрой Сосны при впадении в неё реки Ельчик. Город входит в перечень исторических городов России.

Население — 102 362 человека (2020).<br>
В городе есть несколько пересыхающих ручьёв, в частности, Лучок, давший название одному из районов города, и Пажень.
8 октября 2007 года Ельцу присвоено звание «Город воинской славы».<br>
В первое воскресенье сентября празднуется день города."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Елец</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/gryazi">
              <path
                id="eleven"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Грязинский район"
                className="part"
                d="m 344.74492,227.3176 -2.86408,0.90444 -1.80889,-1.95963 -4.07001,0.60296 -3.31631,-2.5626 h -2.86408 l -2.26112,1.20593 -1.35667,2.71334 -7.23557,0.90445 -1.95963,-1.80889 2.41185,-1.35667 -1.20592,-2.18575 -3.01483,1.50741 -2.63797,-1.88426 -1.35667,0.0754 -0.30148,2.5626 -2.11037,0.15074 -0.82908,1.2813 0.97982,2.035 1.35667,1.05519 v 13.49133 l -2.03501,2.78871 1.13056,9.34595 -1.13056,1.43204 -0.22611,1.80889 3.8439,2.18575 1.20593,-1.20593 1.80889,0.67833 1.78089,3.04657 0.85272,3.73066 -1.81203,1.91862 -4.79655,-2.2384 -2.1318,-3.1977 -4.15701,1.27908 -0.42636,0.95931 -5.36379,-0.0338 -2.07269,1.95963 0.0377,5.50205 -2.37417,0.18843 -1.99732,-3.69316 -2.29881,-0.67833 -0.82907,6.63261 4.37149,5.84122 0.77368,4.9065 -6.92836,7.62119 -3.99713,-0.63954 3.46418,4.53008 2.66475,5.54268 -0.21318,2.02521 -3.89053,0.21318 -1.33238,2.02521 -1.27908,-0.15988 -0.74613,-1.91862 -3.35759,-0.15989 -3.99713,1.33238 -1.0126,-1.86533 -1.70544,-1.11919 -3.73065,2.61145 0.26647,3.51748 4.21031,2.1318 -0.0533,2.66475 1.54556,3.62406 2.98452,-0.15989 0.53295,2.87794 1.54556,0.79942 3.25099,-2.0785 0.74613,-2.1851 4.3169,-0.0533 1.33238,2.61146 3.1977,-2.55816 8.04755,-0.53295 3.78395,2.55816 2.93122,-2.82464 3.51747,0.47966 3.89054,-2.1851 3.03782,1.01261 0.90601,1.65214 1.33238,-1.59885 5.54268,-0.26647 4.05043,-1.70544 2.29168,0.37306 1.01261,1.33238 -1.38567,0.95931 -0.26648,2.45157 1.22579,1.49226 4.15701,0.0533 2.82464,1.75873 1.22578,2.50487 3.1977,-0.21318 0.26648,-3.35759 3.35759,0.37307 3.25099,1.97191 3.46418,4.58338 6.34211,-1.65215 2.71805,-2.29169 3.83724,2.02521 2.23839,-1.33237 0.95931,2.87793 1.49226,-0.15988 0.15989,-5.64928 4.74325,-6.18222 1.81203,0.42636 1.70545,-0.79943 1.75873,-3.35758 -1.54555,-2.82464 3.1444,-4.58337 2.1318,-0.74613 1.17249,-1.81203 -1.70544,-2.34499 1.17249,-6.18222 3.41089,-0.74613 -0.95932,-2.34498 0.21319,-6.92836 -1.38568,-2.45157 2.02522,-3.1977 -6.71518,-0.63954 -8.63379,-8.95356 H 371.04 l -5.3295,-5.86246 -2.87793,4.68997 -5.3295,-3.73066 5.3295,-6.60858 -10.33924,-2.23839 -5.43609,-15.0292 5.86245,-3.41088 z"
                description-data="<img src='/gerb/grz.png'><br> Грязинский район<br><br> Район образован 30 июля 1928 года из части территории Липецкого уезда в составе Центрально-Чернозёмной области (ЦЧО) (до 16 сентября 1929 входил в Козловский округ, до 1930 — в Усманский округ). После разделения ЦЧО 13 июня 1934 года вошёл в состав Воронежской области. С образованием 6 января 1954 года Липецкой области включён в её состав. 19 ноября 1959 года к Грязинскому району была присоединена часть территории упразднённого Липецкого района. 1 февраля 1963 район был упразднён (территория вошла в Липецкий, Добринский и Усманский районы), но 11 января 1965 года восстановлен."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Грязинский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/dobrinka">
              <path
                id="twelve"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Добринский район"
                d="m 388.3091,285.20218 0.45222,7.38632 1.20593,1.20593 -3.91927,0.45222 -1.0175,6.25575 1.31899,2.52492 -0.94213,1.88426 -2.33649,1.09288 -2.67566,3.91926 -0.15074,0.86677 1.35667,2.44954 -2.2988,3.61779 -1.16824,0.64065 -1.92195,-0.71603 -4.52224,6.29345 -0.11305,5.16288 -1.88427,0.90445 -2.63796,2.63797 -2.78872,6.36881 -2.11037,1.77121 0.0377,6.1427 -0.94213,1.46972 3.24094,6.70798 1.20593,0.64065 2.26111,0.0754 2.60029,3.65547 -0.18843,6.1427 1.31898,0.56528 1.62047,2.44955 0.15074,4.48454 -1.50741,2.97714 3.46705,1.20593 1.88426,2.52491 0.94213,3.16557 -1.24361,3.24093 0.18842,2.97714 1.5451,2.035 -0.48991,4.82372 -1.84658,1.69584 0.37686,1.92194 0.0377,2.63797 0.94213,5.80354 c 0,0 5.01215,1.7712 5.16289,1.80889 0.15074,0.0377 8.02696,-1.39436 8.02696,-1.39436 l 5.04983,2.03501 1.65815,3.46704 5.72816,1.35667 1.05519,1.05519 2.71334,-6.02964 3.61779,-0.60297 6.48186,4.52224 4.3715,-0.15074 3.3163,-3.46705 5.8789,5.27594 6.33113,0.90445 1.50741,-15.52634 2.11038,-3.76853 3.91927,-0.7537 2.86408,-4.52224 5.27594,-1.05518 0.7537,-4.82372 -3.91927,-0.60296 3.01483,-4.97446 -1.95964,-3.61779 -3.16556,-0.7537 -1.20593,-3.91927 3.3163,-1.05519 0.30149,-4.97446 3.16556,-4.07001 -1.05519,-4.37149 0.90445,-2.5626 4.82371,-1.35667 1.05519,1.35667 0.45222,-6.02964 v -3.46705 l 7.23558,7.23558 2.11037,-2.11038 -3.3163,-6.78335 -0.45222,-5.72816 -8.59225,-6.78335 -10.55188,1.05519 -0.7537,3.46704 -3.16556,-1.50741 -1.20593,-5.27594 0.90444,-5.57742 -3.16556,-4.67297 -7.23557,0.60296 -1.05519,-6.02964 -12.96374,-2.26112 -5.42668,3.16556 -3.01482,-3.61778 -0.15074,-3.01483 -8.14002,-2.26111 -1.80889,-4.97446 2.86408,-3.76853 0.30148,-2.41185 2.5626,-0.45223 0.60296,-4.52223 -7.68779,0.90445 z"
                description-data="<img src='/gerb/dobrinka.jpg'> <br><b>Добринский район</b><br><br>
Район образован 30 июля 1928 года в составе Борисоглебского округа Центрально-Чернозёмной области. Первый районный съезд Советов проходил 8-9 июля 1928 г. В соответствии с Постановлением ВЦИК РСФСР от 16 сентября 1929 г. район вошел в состав Усманского округа ЦЧО.
После ликвидации округов на основании Постановления ЦИК и СНК СССР от 23 июня 1930 г. Добринский район остался в составе ЦЧО. Постановлением Президиума ВЦИК РСФСР от 1 февраля 1933 г. в состав Добринского района были включены Богородский 3-й, Дуровский, Нижне-Матренский, Никольский, Ольховский, Отскоченский, Пушкинский, Салтыковский, Средне-Матренский и Хворостянский сельсоветы ликвидированного Хворостянского района.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Добринский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/usman">
              <path
                id="thirteen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Усманский район"
                d="m 377.11564,400.24568 -7.14154,2.1318 0.21318,6.502 -6.60858,2.87793 -13.21717,-5.11632 -2.34498,1.91862 -3.73065,-2.66476 -3.83724,3.41089 1.81203,2.66475 -4.90314,6.50199 -7.99426,0.85272 -5.86245,-3.30429 -2.77134,3.83724 -20.35871,-5.22291 -18.2269,-6.82176 -1.17249,-9.06016 2.34498,-3.09111 -3.09111,-4.37019 1.81203,-2.23839 -3.73065,-5.32951 -3.51747,0.10659 -1.70544,-3.30429 -2.98452,2.45157 -6.71518,-4.15701 -2.1318,0.74613 h -0.42636 l -1.0659,-9.48652 2.45157,-2.77134 -1.0659,-1.49226 1.70544,-4.58337 0.74613,-7.46131 -1.59885,-1.17249 -1.27908,-6.82176 -2.23839,-2.66475 v -3.83724 l 4.05042,1.38567 4.05042,-2.87793 -2.02521,-3.19771 2.87793,-3.09111 1.91863,0.85272 2.87793,0.31977 2.34498,-2.87793 -1.97192,-1.33237 3.67736,-5.54269 -2.61146,-0.69283 0.0533,-2.34498 c 0,0 3.33888,-1.21007 3.48962,-0.90859 0.15074,0.30148 0.82908,3.16556 0.82908,3.16556 l 1.95963,0.75371 2.78871,-2.11038 0.45223,-2.26111 4.52223,-0.15074 1.20593,2.5626 3.24093,-2.33649 7.91391,-0.60297 4.22075,2.5626 3.0902,-3.09019 3.3163,0.75371 3.91927,-2.26112 2.78871,0.97982 0.67833,1.80889 1.8089,-1.58278 5.1252,-0.30148 4.82371,-1.95964 2.18575,0.67834 0.82907,1.50741 -1.73352,0.52759 0.15074,3.09019 1.2813,1.13056 3.69316,-0.30148 2.93945,2.035 1.2813,2.48723 2.93945,-0.45222 0.30148,-3.39168 3.54242,0.45223 3.16556,1.95963 3.31631,4.67298 7.08483,-1.73353 2.035,-2.035 4.3715,1.88426 1.88426,-1.35667 0.90445,3.0902 -3.0902,3.01482 -2.86408,6.33112 -1.95963,1.50742 v 6.25575 l -1.05519,1.43204 4.29612,7.31095 h 2.78871 l 2.78871,3.76852 -0.22611,6.25576 1.50741,0.75371 1.05519,1.80889 0.45222,4.97446 -1.65815,2.56259 3.54242,1.43205 2.71334,5.57742 -1.20593,3.16556 0.0754,2.86408 1.58278,2.03501 -0.45222,5.50205 -1.73352,1.13055 z"
                description-data="<img src='/gerb/usman.png'> <br><b>Усманский район</b><br><br>
Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1929 входил в Воронежский округ, до 1930 — в Усманский). В 1929—1930 назывался Сторожевским районом. После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской области. С образованием 6 января 1954 года Липецкой области стал её частью.

В 1956 году в Усманский район вошёл Грачёвский, а в 1963 — Октябрьский районы.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Усманский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/hlevnoe">
              <path
                id="fourteen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Хлевенский район"
                d="m 189.51713,377.96836 -3.30429,-4.90314 h -2.98452 l -6.18223,-7.88767 8.42062,-6.3954 1.70544,0.10659 0.63954,-3.73065 5.43609,-4.47679 3.73065,-2.23839 1.17249,-4.2636 2.2384,1.27908 3.09111,0.10659 2.34498,-2.87793 -3.09111,-4.90314 -1.17249,-9.06016 1.17249,-0.95931 3.51747,0.37307 1.38567,1.75873 2.50487,-0.95931 1.54555,-2.1318 -0.26647,-1.49226 4.95644,-0.26648 2.0785,1.38567 2.50487,-0.58624 0.90601,-1.49226 7.30142,0.37306 0.74613,-2.02521 6.02234,-6.12893 2.23839,2.02521 5.4361,-3.03781 2.93122,0.47965 6.39541,3.57077 0.37306,6.92835 6.4487,-0.37306 1.22579,-2.39828 2.34498,2.02521 1.59885,2.1851 1.22578,4.21031 -1.43896,2.45157 1.81203,2.93123 -3.67736,2.98452 -3.99713,-1.22579 -0.26647,3.89054 2.23839,3.35759 1.01261,6.28881 1.81203,1.01261 -0.85272,7.03494 -1.70544,4.05042 1.11919,2.45157 -2.55816,2.39828 0.53295,9.91288 -6.02234,-5.27621 -7.40801,0.37306 -4.79655,6.12893 -9.53981,-2.55816 -3.1977,2.39828 2.71804,5.00973 -1.86532,2.1318 -8.36732,0.26647 -1.0659,3.89054 1.17249,6.23552 -0.26648,5.75586 -9.85958,-0.0533 z"
                description-data="<img src='/gerb/hlevnoe.png'> <br><b>Хлевенский район</b><br><br>
Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1929 входил в Воронежский, а до 1930 — в Усманский округ).
После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 6 января 1954 года — во вновь образованную Липецкую область.
19 февраля 1944 года часть территории Хлевенского района была передана в новый Дмитряшевский район[5]. 4 июля 1956 года в Дмитряшевский район был присоединён обратно к Хлевенскому.
1 февраля 1963 район был упразднён (территория вошла в Задонский район), но 11 января 1965 года восстановлен.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Хлевенский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/lipetsk-region">
              <path
                id="fiftheen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Липецкий район"
                d="m 268.31918,201.69161 3.69315,-0.60297 1.58279,-2.78871 7.68779,-3.91927 4.74835,1.73353 1.35667,-1.88427 2.78871,0.82908 2.71334,-0.97982 1.73352,2.03501 -3.16556,10.4765 10.77799,2.93945 4.67297,5.42668 6.63261,2.03501 3.09019,6.10501 1.43204,1.05519 -2.78871,1.13056 -2.41185,-1.80889 h -1.50742 l -0.45222,2.63797 -1.95963,0.0754 -0.97982,1.20593 1.50741,2.63797 1.05519,1.20592 0.22611,9.34595 -2.035,-0.22611 -1.20593,1.2813 -1.2813,-0.15074 -2.03501,-3.46705 -1.88426,-1.58278 -3.91927,0.60297 -1.80889,-1.43204 1.65815,-4.97446 -1.95964,-2.03501 -3.84389,2.63797 -3.16557,-2.86408 2.48723,-1.73352 0.30148,-1.73352 -1.65815,-1.65815 -10.47651,10.62724 0.90445,3.46705 -0.60296,1.35667 -3.39168,3.76853 -2.63797,0.22611 0.0754,2.26112 -2.26112,0.90444 -0.0754,3.8439 3.8439,0.37685 3.69316,3.0902 1.58278,0.45222 0.37685,3.69316 3.39168,1.73352 5.04983,4.67297 0.0754,6.63261 -0.82908,3.01482 0.45222,3.69316 4.07001,5.20057 0.67834,2.03501 v 3.3163 l -7.1602,7.38631 -3.8439,-1.05518 3.99464,4.74834 2.63797,6.18039 -0.5276,1.35667 -3.91927,0.22611 -1.20592,1.95963 -1.43205,0.15074 -0.37685,-2.26111 -3.76853,0.0754 -3.76852,1.2813 -1.05519,-2.03501 -2.18575,-1.05519 -3.24093,2.11038 0.15074,3.8439 3.69316,2.11037 0.52759,3.39168 1.50741,3.3163 -0.89202,0.85151 0.15989,1.86532 2.34498,0.79943 -1.01261,2.71804 -2.23839,2.93123 1.81203,1.22579 -2.29168,2.87793 -5.32951,-0.85272 -0.63954,0.63954 -1.54555,-4.58338 -2.66475,-3.46417 -1.01261,-0.42636 -1.22578,2.61145 -6.39541,0.31977 -0.37306,-7.14153 -6.07564,-3.67736 -3.73065,-0.21318 -5.11632,2.66475 -5.75587,-6.82176 2.2384,-1.91862 -1.17249,-1.27908 -3.19771,-1.0659 -3.09111,-6.07564 -2.55816,-1.27908 3.51747,-2.34498 -0.95931,-4.47678 0.58625,-0.74613 2.0785,-1.86533 -2.1318,-0.90601 -0.53295,-0.79943 1.43897,-0.69283 3.83724,-0.53295 -0.21318,-7.83437 -1.70544,-0.37307 3.1977,-2.02521 -0.74613,-1.59885 -7.08824,1.43897 -1.11919,-1.33238 0.53295,-2.23839 0.10659,-4.05042 -1.27909,-1.0659 4.26361,-5.91575 3.03781,-2.98452 5.16962,-1.1725 2.45157,2.02522 4.15702,-3.251 -2.87794,-4.47678 1.38568,-1.33238 -2.34499,-1.81203 -1.86532,1.0659 c 0,0 -0.95931,-1.65215 -1.17249,-1.59885 -0.21318,0.0533 -3.99713,2.34498 -3.99713,2.34498 l -1.49226,1.70544 -1.91862,-1.0126 -4.95644,0.10659 3.41088,-5.70257 -1.0126,-4.2636 -3.35759,0.21318 -2.66475,0.85272 -0.58625,-1.59885 -3.67735,2.29168 -1.49227,-0.37306 -0.85272,-1.1192 0.37307,-2.1851 0.79942,-1.49226 -1.91862,-0.26647 -1.59885,0.63954 -1.86532,-2.23839 3.67735,-3.99713 -0.10659,-3.94383 1.33238,-0.79943 1.65215,1.75874 0.85272,-2.98452 1.65214,-1.17249 -0.79942,-7.30142 -2.29169,-0.15989 -1.1192,-1.11919 2.55817,-3.41089 7.72778,1.43897 1.81203,3.14441 1.75873,0.10659 0.79943,-1.38567 4.21031,-1.01261 2.39827,0.90602 2.1851,-0.31977 2.02521,-1.59886 5.70257,0.69284 1.81203,-0.53295 -0.26648,-9.37993 2.1318,-0.0533 2.93123,-1.86533 9.6464,-2.34498 z"
                description-data="<img src='/gerb/lipraion.jpg'><br> <b>Липецкий район</b> <br><br>
Липецкий район расположен в центре Липецкой области. Граничит с Лебедянским, Добровским, Хлевенским, Усманским, Задонским и Грязинским районами Липецкой области. Включает 21 муниципальное образование: 21 Сельское поселение. Всего 86 сельских населённых пунктов. Административный центр — в городе Липецк (в состав района не входит, является городом областного подчинения).
<br>
    Площадь 1510 кв.км. <br>Население на 2010 год - 43 731 человек.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Липецкий район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/lipetsk">
              <path
                id="sixteen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="г. Липецк"
                d="m 310.67743,240.20596 c 0,0.90445 -0.0754,3.61779 -0.0754,3.61779 l -2.26112,2.86408 0.90445,5.1252 -0.0754,4.5976 -1.05519,1.80889 v 1.20593 l 3.24093,1.95964 1.88427,-0.90445 2.035,1.13056 1.58279,2.78871 0.7537,3.39167 -1.13056,1.43204 -1.73352,0.5276 -3.69316,-1.95964 -2.63797,-3.54241 -3.8439,1.35667 -0.37685,1.2813 -5.35131,-0.5276 -2.035,1.95964 -0.0625,6.15023 -2.23839,-0.21318 -2.1318,-3.83724 -2.45157,-0.53295 0.42636,-6.28882 -5.22291,-4.58337 -3.73066,-1.59885 -0.53295,-3.94383 -1.81203,-0.53295 -3.51747,-3.19771 -3.62406,0.10659 -0.21318,-3.94383 2.34498,-0.95931 0.31977,-2.02521 2.34498,-0.63954 3.94383,-4.15701 0.21318,-1.81203 -0.85272,-2.55816 10.12606,-10.87219 1.81203,1.49226 v 1.81203 l -2.66475,1.38567 3.09111,3.30429 3.73065,-2.55816 2.02521,2.1318 -0.56945,3.46481 -0.86676,1.31898 1.43204,1.46973 4.18307,-0.0754 2.37417,1.95963 1.35667,3.01483 1.69584,0.15074 0.86676,-1.43204 z"
                description-data="<img  src='/gerb/lipetsk.jpg'><br> <b>Липецк</b> <br><br> Липецк – столица Липецкой области с населением более полумиллиона человек. Город известен, как крупный производитель стали, стройматериалов, быттехники, минеральной воды и соков. Также здесь находится Липецкий авиацентр, где готовят пилотов российской авиации.
Дата основания Липецка: 1703 г.<br>
Население города: 509 735 чел. (2018 г.)<br>
Площадь города: 330 км²"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Липецк</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/dolgorukovo">
              <path
                id="seventeen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Долгоруковский район"
                d="m 156.47421,304.6344 -4.68996,-0.95931 -1.59885,-2.87794 -0.21318,-5.00973 h -2.45157 l -2.34499,-2.1318 -1.0659,0.21318 -3.73065,5.3295 -5.86245,-1.59885 -2.23839,4.37019 h -4.26361 l -1.81203,-2.45157 -2.87793,1.49226 -1.70544,-0.85272 -0.85272,-1.81203 -0.31977,-2.77134 -2.02521,-0.74613 -2.02521,-2.1318 -1.0659,1.38567 -3.19771,-2.55816 -2.1318,-0.21318 -0.95931,-1.91862 -2.02521,-0.10659 0.21318,-3.1977 1.70544,-1.91863 v -6.60858 l 1.91862,-1.0659 -0.74613,-1.17249 -1.27908,-0.63954 h -1.59885 l -3.30429,3.94383 -1.91862,-0.85272 -3.837243,0.21318 -2.344982,1.38567 -0.31977,1.17249 -2.877931,0.42636 -2.238392,-2.87793 -5.969043,0.42636 -5.969044,2.34498 0.426361,3.73065 0.95931,1.81204 0.42636,4.79655 v 3.09111 l -2.771341,-0.95931 -5.116323,-1.49226 -6.182224,-2.02521 -8.527205,0.10659 -1.38567,2.66475 0.21318,3.1977 -0.532951,3.83724 -0.63954,1.70544 0.53295,6.71518 3.517472,5.43609 5.436094,0.95931 1.17249,1.91862 -2.984522,2.87793 -0.42636,6.07564 8.740385,2.02521 3.624062,-6.92835 4.050423,2.34498 -0.21318,1.70544 -1.598851,1.49226 4.689962,16.62805 2.771342,2.77134 5.222913,1.70544 1.705441,-0.31977 -2.558161,-8.74038 1.59885,-1.91863 2.558162,0.42636 2.238391,-2.66475 7.461305,3.62407 1.49226,2.1318 4.79655,-0.10659 2.34498,0.53295 2.98453,0.21318 2.1318,3.51747 0.74613,0.42636 v 6.18222 l 4.05042,1.0659 2.55816,3.3043 5.00973,0.85272 1.81204,-2.2384 2.34498,-2.1318 -0.53295,-2.98452 2.45157,-0.74613 1.91862,1.49226 3.30429,-0.21318 3.1977,2.77134 11.51173,-6.60858 3.09111,-1.0659 1.38567,-2.87793 h 2.45157 l 2.66476,-5.00974 -4.05043,-3.94383 0.21318,-1.91862 2.23839,-1.27908 -2.1318,-5.22291 -2.87793,-1.0659 -1.49226,-0.74613 0.95931,-6.71518 -4.37019,-4.79655 z"
                description-data="<img src='/gerb/dolgorukovo.png'> <br><b>Долгоруковский район</b><br><br>
Долгоруковский район расположен в юго-западной части Липецкой области, на отрогах Среднерусской возвышенности. Район характеризуется наличием таких полезных ископаемых, как песчаник, глина, известняк. Площадь района составляет 990 км².
Район граничит с Орловской областью, а также с Измалковским, Елецким, Задонским и Тербунским районами Липецкой области.
По территории района протекают реки Олым, Свишня, Снова, Сосна.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Долгоруковский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/zadonsk">
              <path
                id="eighteen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Задонский район"
                d="m 209.83163,206.21384 c 0,1.05519 -0.5276,4.44686 -0.5276,4.44686 l 7.61243,3.0902 -2.33649,3.09019 0.75371,1.50741 2.48723,0.15074 0.60296,7.1602 -1.2813,1.43204 -0.90445,2.86408 c 0,0 -1.50741,-1.65815 -1.80889,-1.65815 -0.30148,0 -1.35667,1.05519 -1.35667,1.05519 l 0.45222,3.76853 -3.91927,4.14538 1.65816,1.58278 3.46704,-0.15074 -1.20593,3.61779 1.2813,1.50741 4.67298,-1.88427 0.37685,1.05519 6.10502,-0.60296 1.35667,3.84389 -3.39168,5.72817 5.04983,0.15074 1.43204,0.67833 5.57742,-3.46704 1.20593,1.50741 2.18574,-1.20593 1.95964,1.95963 -1.35667,1.05519 3.16556,4.44686 -4.07001,3.16557 -2.48723,-2.26112 -4.5976,1.05519 -3.69316,2.93945 -0.30148,1.73352 -1.50741,1.65816 -2.26112,2.63797 1.05519,1.95963 -0.37685,3.54242 -0.45223,2.48722 1.2813,1.20593 7.08484,-1.50741 0.82907,1.65815 -3.16556,1.95964 1.88426,0.82907 -0.0754,7.00947 -4.52223,1.20593 -0.45222,1.20592 2.71334,0.82908 -1.05519,1.50741 c 0,0 -1.43204,-0.15074 -1.50741,0.67834 -0.0754,0.82907 0.45222,4.89908 0.45222,4.89908 l -3.39168,2.18575 1.20593,1.20593 4.44687,6.70798 2.63797,0.90444 1.43204,1.73353 -1.50741,0.90444 0.7537,1.95964 2.41186,3.3163 -6.02965,6.10502 -0.45222,2.035 H 222.117 l -0.97982,1.13056 -2.33649,0.45222 -2.48723,-1.05518 -4.14538,0.0754 -0.90444,0.30148 0.67833,1.50741 -1.2813,2.035 -2.48723,0.67834 -2.33648,-1.50741 -3.16557,-0.75371 -1.35667,1.58278 1.50741,8.9691 3.01483,5.1252 -2.5626,2.33649 -3.16557,-0.30149 -1.28129,-0.90444 -1.43205,1.2813 -0.82907,3.46704 -8.51687,6.33113 -0.90445,3.39167 -1.73352,0.22612 -10.77799,8.21539 -6.70798,-1.2813 -0.60297,-4.89909 2.86408,-3.8439 -0.82907,-2.71334 -3.24094,-1.50741 -6.70798,-0.15074 -3.01482,1.88426 -1.20593,-3.3163 2.33649,-3.01482 -2.26112,-3.31631 2.86409,-0.90444 1.13055,-2.93946 2.26112,0.15075 3.09019,-5.1252 -4.14538,-4.52224 0.30148,-1.73352 2.5626,-0.90445 -2.18574,-5.50205 -2.78871,-0.7537 -1.95964,-1.20593 0.75371,-6.33113 -2.18575,-2.78871 -1.50741,-2.41186 3.01482,-5.3513 1.20593,-3.16557 -0.82907,-3.99464 4.29612,-2.035 2.63797,-2.41186 -0.97982,-4.07001 v -3.46705 l -0.90445,-3.16556 0.45223,-4.07001 2.5626,-3.39167 0.52759,-1.73353 3.3163,-3.16556 6.10502,5.72816 4.97446,2.33649 2.63796,-2.03501 -2.26111,-1.05518 -0.97982,-3.0902 0.90445,-1.58278 1.20593,-0.22611 -0.60297,-1.50741 -2.11037,-0.37685 0.0754,-1.13056 2.78871,-0.60297 0.67833,-0.97981 -1.58278,-3.8439 -4.22075,-0.82908 -0.0754,-1.80889 1.73352,-0.22611 2.18575,0.97981 1.88426,-1.65815 -3.91927,-5.20057 -0.15074,-3.39167 3.39168,-0.67834 2.63797,-1.88426 h 3.84389 l 3.99464,-1.95963 2.48723,0.22611 2.11038,-1.88427 -2.63797,-3.8439 -0.15074,-3.69315 -2.93945,-4.67298 1.2813,-0.82907 0.7537,-0.0754 2.71334,-6.33113 2.93945,-2.33649 1.58278,-2.48723 0.82908,-12.13466 3.46705,-0.60296 3.01482,1.80889 z"
                description-data="<img src='/gerb/zadonsk.jpg'> <br>Задонский район<br>
Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 27 сентября 1937 года — во вновь образованную Орловскую область. После образования 6 января 1954 года Липецкой области включён в её состав.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Задонский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/terbuni">
              <path
                id="nineteen"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                region-name="Тербунский район"
                className="part"
                d="m 63.462008,324.69635 8.441502,2.5626 3.014822,-6.78335 4.220751,2.5626 0.150741,1.35667 -2.110375,1.50741 5.125198,17.63671 6.331126,3.31631 3.014822,-0.15075 -2.562598,-8.59224 1.507411,-2.11037 2.411857,0.90444 2.261117,-2.71334 7.687798,3.16557 0.82907,2.26111 6.4065,-0.22611 1.58278,1.05519 2.5626,-0.0754 1.50741,2.5626 1.50741,1.05519 0.0754,6.40649 4.22075,1.05519 2.33648,3.16556 4.89909,1.05519 1.43204,-1.95963 2.5626,-2.78871 0.0754,-2.78871 2.18575,-0.75371 1.50741,1.35667 3.76852,0.15074 3.39168,2.86408 11.45632,-6.93409 1.95964,2.93945 -1.95964,3.39168 1.35667,3.3163 2.5626,-1.65815 6.70798,0.15074 3.54242,1.43204 0.82907,2.41186 -2.63796,3.69316 -0.0754,5.12519 6.78335,1.8089 2.86409,-2.48723 5.27593,7.91391 3.76853,0.67833 2.71334,2.86408 -9.45632,2.95348 -5.22291,6.18222 5.00973,4.3702 -1.70544,3.51747 -8.95356,-3.73065 -2.87793,-5.11633 0.31977,-3.41088 -2.77135,-5.64927 -4.37019,0.95931 -0.74613,7.78107 -6.3954,5.96905 -6.71518,-4.68997 -3.73065,2.98452 -2.87793,-1.59885 -4.47678,3.51748 -1.0659,4.37019 -15.24238,2.55816 0.85272,4.37019 -10.23265,1.59885 -1.81203,-0.74613 -4.05042,3.83725 -3.517473,0.95931 -2.984521,-1.27908 -2.344982,0.63954 -2.344981,-3.41089 -0.959311,1.59885 -4.476782,-1.38567 -3.197702,-3.73065 -2.131801,0.85272 -4.263603,-4.2636 0.746131,-4.05042 1.17249,-2.77134 -1.492261,-1.81204 h -2.238391 l -1.385671,-1.27908 -0.10659,-1.81203 1.812031,-0.31977 1.918621,-2.1318 0.959311,-0.95931 2.344981,0.85272 -0.53295,-2.45157 -3.091112,0.21318 -1.0659,-1.0659 -3.943833,-0.85272 -2.025211,-0.74613 1.065901,-1.70544 -0.21318,-1.59885 1.17249,-2.55817 -0.31977,-2.98452 -0.95931,-0.95931 -0.319771,-2.98452 0.639541,-1.0659 -0.426361,-2.02521 -1.49226,-2.45157 -1.172491,-0.63954 -3.837242,0.63954 -5.116323,-0.21318 v -2.87793 l 1.492261,-1.59885 -1.598851,-2.13181 2.025211,-13.00398 1.172491,-2.55817 0.21318,-3.30429 -2.131802,-2.23839 3.197702,-3.62406 z"
                description-data="<img src='/gerb/terbuni.jpg'> <br><b>Тербунский район</b><br><br>
Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 18 января 1935 года — Курской области. После образования 6 января 1954 года Липецкой области включён в её состав.
"
              />
            </Link>
            <foreignObject className="win__two">
              <span>Тербунский район</span>
            </foreignObject>
          </g>
          <g>
            <Link to="/blog/regions/volovo">
              <path
                id="twenty"
                stroke="blue"
                fill="white"
                fillOpacity="0.5"
                onMouseEnter={hoverRegion}
                onMouseLeave={leaveRegion}
                strokeOpacity="0.8"
                className="part"
                region-name="Воловский район"
                d="m 60.447185,337.66009 -2.261116,14.16966 1.507411,1.8089 -1.658152,1.80889 -0.150741,3.46705 6.707979,-0.0754 2.71334,-0.67833 2.035005,2.33649 1.130558,2.78871 -0.979817,1.50741 0.527594,2.78871 0.979817,1.20593 -0.226111,4.07001 -1.055188,1.05519 0.904446,1.13055 -1.281299,2.11038 2.035005,1.2813 3.467046,0.37685 1.507411,1.65815 2.864081,-0.90444 0.602964,1.88426 h -2.336487 l -2.562599,3.01482 -1.884264,-0.15074 -0.150741,2.33649 1.658152,1.2813 2.035005,0.0754 1.733523,1.95963 -1.281299,2.41186 -0.678335,3.54242 3.693157,4.37149 2.864081,-0.15074 2.110376,2.41186 5.049827,2.18574 1.130558,-1.2813 2.261117,3.0902 2.71334,-0.5276 1.205929,1.58278 -3.240934,5.57743 -0.678335,4.82371 -5.954274,-2.48723 -3.240934,2.93945 -3.090193,-3.24093 -5.954274,0.45222 -2.336487,3.61779 -8.969096,2.93945 0.452223,2.86408 -7.386314,-3.01482 c 0,0 -9.647431,1.58278 -10.024284,1.58278 -0.376853,0 -2.487228,-0.30148 -2.487228,-0.30148 l -0.301483,-4.67297 -2.562598,-0.0754 -0.150741,5.27593 -5.125198,-0.45222 v -5.72816 l -4.07001,-5.57742 -1.884264,-6.48187 -1.2813,-4.29612 -4.14538,-5.27594 -3.843898,-1.58278 -0.753706,-7.53706 -1.658152,-4.82371 3.165563,0.90444 0.376853,-7.91391 2.110375,-2.26111 0.904447,-10.09966 0.452223,-3.09019 -3.693157,0.15074 v -2.63797 l 3.467046,-2.33648 3.240934,-0.0754 5.125197,-8.36613 4.597604,-0.52759 1.205929,-4.07001 7.084832,-2.03501 4.220751,-3.61778 4.974457,3.39167 z"
                description-data="<img src='/gerb/volovo.jpg'> <br><b>Воловский район</b><br><br>
Район образован 30 июля 1928 года в составе Центрально-Чернозёмной области (ЦЧО) (до 1930 входил в Елецкий округ). После разделения ЦЧО 31 декабря 1934 года вошёл в состав Воронежской, а 18 января 1935 года — Курской области. После образования 6 января 1954 года Липецкой области включён в её состав. 1 февраля 1963 район был упразднён (территория вошла в Тербунский район), но 11 января 1965 года восстановлен."
              />
            </Link>
            <foreignObject className="win__two">
              <span>Воловский район</span>
            </foreignObject>
          </g>
        </g>
      </svg>
      <div id="descriptionmap" className=""></div>
      {tooltip && (
        <motion.div
          initial={{ opacity: 0 }}
          animate={{ opacity: 1 }}
          exit={{ opacity: 0 }}
          transition={{ duration: 1 }}
          key={tooltip._id}
          className="absolute bg-blue-800 text-white text-sm p-2 rounded-md
          shadow-lg flex flex-col gap-2 items-center"
          style={{
            top: position.y + 370, // Смещение подсказки ниже курсора
            left: position.x + 10, // Смещение подсказки вправо от курсора
            pointerEvents: "none", // Чтобы подсказка не мешала взаимодействию с элементами
          }}
        >
          <span>{tooltip._id}</span>
          <span>Новостей всего: {tooltip.count} </span>
        </motion.div>
      )}
    </div>
  );
};

export default React.memo(MapReg);
